In [5]:
import pandas as pd
import random as rn
import string as s

In [3]:
s1= pd.Series([1,23,3])
s1
##here we can make our own indexing in series

0     1
1    23
2     3
dtype: int64

In [6]:
b1=['a','b','c']
a1=[1,2,3]
c1=pd.Series(b1,a1)
c1

1    a
2    b
3    c
dtype: object

Take dictionary as argument for q1           
take LOL as argument            
take DOL as argument       
take DOD as argument

In [7]:
d={1:'a',2:'b',3:'c'}
s2=pd.Series(d)
s2

1    a
2    b
3    c
dtype: object

In [8]:
l=[[1,2],[3,4],[5,6]]
s3=pd.Series(l)
s3

0    [1, 2]
1    [3, 4]
2    [5, 6]
dtype: object

In [42]:
dol= {1:['a','b'], 2:['c','d']}
s4=pd.Series(dol)
s4

1    [a, b]
2    [c, d]
dtype: object

In [41]:
dod={1:{2:'a'},3:{4:'d'}}
s5=pd.Series(dod)
s5

1    {2: 'a'}
3    {4: 'd'}
dtype: object

Data Frames

In [3]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
df.head()

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
df=pd.DataFrame([1,2,3,4,5],index=['a','b','c','d','e'])
df

   0
a  1
b  2
c  3
d  4
e  5

In [26]:
dol={'A':[rn.randint(5, 10) for _ in range(5)], 'B':[rn.randint(11,16) for _ in range(5)],'C': [rn.choice(s.ascii_letters) for _ in range(5)],'D': [1 for _ in range(5)], 'E':[" ".join(rn.sample(s.ascii_letters,5)) for _ in range(5) ] }
d=pd.DataFrame(dol)
d

    A   B  C  D          E
0  10  11  F  1  v X W E m
1   9  11  K  1  u a V H X
2   8  16  k  1  y q Z r s
3  10  15  l  1  Z w C K b
4   8  11  F  1  j a u R W

In [30]:
d.describe()

          A         B    D
count   5.0   5.00000  5.0
mean    9.0  12.80000  1.0
std     1.0   2.48998  0.0
min     8.0  11.00000  1.0
25%     8.0  11.00000  1.0
50%     9.0  11.00000  1.0
75%    10.0  15.00000  1.0
max    10.0  16.00000  1.0

In [8]:
data = [[rn.randint(1, 100) for _ in range(10)] for _ in range(5)]
df= pd.DataFrame(data)
type(df)
df

    0   1   2   3   4   5   6   7   8   9
0  18  67  25  23  71  75  12  29  43  85
1  59  10  60   3  33  58  97  26  59   1
2   7  18  89  90  39  56  15  81  22  68
3  91  76  71  14  25  87  34  93  28  55
4  26  38  57  93  95  24  72  28  99  60

df[row][col]  this will give wrong output as it was used in python 2,                  
df[Row_range][col_name_in_list]

In [9]:
df[:]

    0   1   2   3   4   5   6   7   8   9
0  18  67  25  23  71  75  12  29  43  85
1  59  10  60   3  33  58  97  26  59   1
2   7  18  89  90  39  56  15  81  22  68
3  91  76  71  14  25  87  34  93  28  55
4  26  38  57  93  95  24  72  28  99  60

In [10]:
df[1:3][:]

    0   1   2   3   4   5   6   7   8   9
1  59  10  60   3  33  58  97  26  59   1
2   7  18  89  90  39  56  15  81  22  68

In [11]:
df[:][[1,2,3]]

    1   2   3
0  67  25  23
1  10  60   3
2  18  89  90
3  76  71  14
4  38  57  93

In [22]:
df[1:4][-3:-1]

    0   1   2   3   4   5   6   7   8   9
1  59  10  60   3  33  58  97  26  59   1
2   7  18  89  90  39  56  15  81  22  68

In [23]:
df[:][[9,3,4]]

    9   3   4
0  85  23  71
1   1   3  33
2  68  90  39
3  55  14  25
4  60  93  95

In [25]:
df.loc[1:3,[1,2,3]]

    1   2   3
1  10  60   3
2  18  89  90
3  76  71  14

In [26]:
df.loc[:]

    0   1   2   3   4   5   6   7   8   9
0  18  67  25  23  71  75  12  29  43  85
1  59  10  60   3  33  58  97  26  59   1
2   7  18  89  90  39  56  15  81  22  68
3  91  76  71  14  25  87  34  93  28  55
4  26  38  57  93  95  24  72  28  99  60

In [28]:
df.loc[:,:]

    0   1   2   3   4   5   6   7   8   9
0  18  67  25  23  71  75  12  29  43  85
1  59  10  60   3  33  58  97  26  59   1
2   7  18  89  90  39  56  15  81  22  68
3  91  76  71  14  25  87  34  93  28  55
4  26  38  57  93  95  24  72  28  99  60

In [30]:
df.loc[1:4,-3:-2]

Empty DataFrame
Columns: []
Index: [1, 2, 3, 4]

In [31]:
type(df)

pandas.core.frame.DataFrame

In [33]:
df.head(2)

    0   1   2   3   4   5   6   7   8   9
0  18  67  25  23  71  75  12  29  43  85
1  59  10  60   3  33  58  97  26  59   1

In [34]:
df.tail(2)

    0   1   2   3   4   5   6   7   8   9
3  91  76  71  14  25  87  34  93  28  55
4  26  38  57  93  95  24  72  28  99  60

In [39]:
data={1:'A',2:'B',3:'C'}
df = pd.DataFrame(list(data.items()), columns=['Number', 'Letter'])
df.iloc[0:1,0:1]

   Number
0       1

In [45]:
df2=[[rn.randint(1, 100) for _ in range(9)] for _ in range(3)]
dff= pd.DataFrame(df2)

In [46]:
df3=pd.concat([dff,df],axis=1)
df3

    0   1   2   3   4   5   6   7   8  Number Letter
0  63  18  75  55  62  20  94  32  16       1      A
1  91  80  78  10  29   2  99  41  82       2      B
2  81  27  49  45  23  87  78  15   5       3      C